Бух_для_edt/src/InformationRegisters/смартОтправленыВУТ/смартОтправленыВУТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОтправленыВУТ</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектОтправки</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.КорректировкаДолга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_для_edt/src/InformationRegisters/смартОчередьСообщенийВУТ/смартОчередьСообщенийВУТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОчередьСообщенийВУТ</name>
  <comment>//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.</comment>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_для_edt/src/Catalogs/смартПредопределенныеЗначения/смартПредопределенныеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПредопределенныеЗначения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПодключенияHTTP</name>
      <description>Подключения HTTP</description>
    </items>
    <items>
      <name>АдресДляОтправкиПакетаНаСкладАдмирал</name>
      <description>Адрес для отправки пакета на склад Адмирал</description>
    </items>
    <items>
      <name>АтлантFTPАдрес</name>
      <description>Атлант FTPАдрес</description>
    </items>
    <items>
      <name>АтлантFTPЛогин</name>
      <description>Атлант FTPЛогин</description>
    </items>
    <items>
      <name>АтлантFTPПароль</name>
      <description>Атлант FTPПароль</description>
    </items>
    <items>
      <name>ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции</name>
      <description>Дата начала контроля отгрузки маркированной продукции</description>
    </items>
    <items>
      <name>ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат</name>
      <description>Дата начала обмена документами с УТ через универсальный формат</description>
    </items>
    <items>
      <name>КаталогСкладаАдмирал</name>
      <description>Каталог склада Адмирал</description>
    </items>
    <items>
      <name>КоличествоПопытокОтправкиУведомлений</name>
      <description>Количество попыток отправки уведомлений</description>
    </items>
    <items>
      <name>ПапкаФайловВложенийУведомлений</name>
      <description>Папка файлов вложений уведомлений</description>
    </items>
    <items>
      <name>ПодразделениеСинхронизации</name>
      <description>Подразделение синхронизации</description>
    </items>
    <items>
      <name>РабочаяБазаБП</name>
      <description>Рабочая база БП</description>
    </items>
    <items>
      <name>РабочийСервер</name>
      <description>Рабочий сервер</description>
    </items>
    <items>
      <name>СкладАдмирал</name>
      <description>Склад Адмирал</description>
    </items>
    <items>
      <name>СкладОсновной</name>
      <description>Склад основной</description>
    </items>
    <items>
      <name>СкладыСписанияТоваров</name>
      <description>Склады списания товаров</description>
    </items>
    <items>
      <name>СтатьяЗатратПоГарантийнымЗапчастям</name>
      <description>Статья затрат по гарантийным запчастям</description>
    </items>
  </predefined>
  <attributes>
    <name>СписокЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТЧСписокЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСписокЗначений</name>
    <attributes>
      <name>к1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>к4</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бух_для_edt/src/Catalogs/смартПравилаОбменаДанными/смартПравилаОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаОбменаДанными</name>
  <predefined>
    <items>
      <name>ПравилаОбменаМаркировкойСУТ</name>
      <description>Правила обмена маркировкой с УТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Правила</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Бух_для_edt/src/CommonModules/смартОбщегоНазначения/Module.bsl
#Область Интерфейс

//++ смарт:Подкин # 28.12.2020 11:11:24 //Подписка на события смартПроведениеКорректировкиДолга
Процедура ПроведениеКорректировкиДолгаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//++ #6654  смарт: Тимофеева 19.05.2026 / Взаиморасчеты. Часть5. Взаимозачет между тремя юр лицами.
	ДатаНачалаОбменаЧерезУФ = Справочники.смартПредопределенныеЗначения.ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат.Значение;
	Если ЗначениеЗаполнено(ДатаНачалаОбменаЧерезУФ)
		И Источник.Дата >= ДатаНачалаОбменаЧерезУФ Тогда
		Возврат;
	КонецЕсли;
	//-- #6654  смарт: Тимофеева 19.05.2026
	
	//++ смарт:Подкин # 06.04.2022 16:14:16  убрал рассылку
	Если Источник.Дата >= Дата("20201231") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	смартОтправленыВУТ.ОбъектОтправки КАК ОбъектОтправки
		|ИЗ
		|	РегистрСведений.смартОтправленыВУТ КАК смартОтправленыВУТ
		|ГДЕ
		|	смартОтправленыВУТ.ОбъектОтправки = &ОбъектОтправки
		|	И смартОтправленыВУТ.Статус";
		Запрос.УстановитьПараметр("ОбъектОтправки", Источник.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.02.2021 11:23:29   временно
			//УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			//ДанныеДляОтправки=Новый Структура;
			//ДанныеДляОтправки.Вставить("Кому","podkin@smart-t.ru"); 
			//ДанныеДляОтправки.Вставить("Тема","В базе бух проведена корректировка!");
			//ДанныеДляОтправки.Вставить("Тело","Проведена Корректировка: "+Источник);
			//ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
			//ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
			//РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки);
			//Смарт }Подкин Алексей Иванович 08.02.2021 11:23:29
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОтправитьКорректировкуДолга", Новый Структура("Источник", Источник.Ссылка), ПараметрыВыполнения);
			ЗаписьЖурналаРегистрации("Документ.КорректировкаДолга", УровеньЖурналаРегистрации.Ошибка,,, "Документ отправлен" + ФЗ.ПодробноеПредставлениеОшибки,);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- смарт:Подкин # 06.04.2022 16:14:16  убрал рассылку
	
КонецПроцедуры

//++ смарт:Подкин # 28.12.2020 11:11:24 //Подписка на события смартПриЗаписиКорректировкиДолга
Процедура ПриЗаписиКорректировкиДолгаПриЗаписи(Источник, Отказ) Экспорт
	
	//++ #6654  смарт: Тимофеева 19.05.2026 / Взаиморасчеты. Часть5. Взаимозачет между тремя юр лицами.
	ДатаНачалаОбменаЧерезУФ = Справочники.смартПредопределенныеЗначения.ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат.Значение;
	Если ЗначениеЗаполнено(ДатаНачалаОбменаЧерезУФ)
		И Источник.Дата >= ДатаНачалаОбменаЧерезУФ Тогда
		Возврат;
	КонецЕсли;
	//-- #6654  смарт: Тимофеева 19.05.2026
	
	Если Источник.ПометкаУдаления И Источник.Дата >= Дата("20201231") Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОтправитьКорректировкуДолга", Новый Структура("Источник", Источник.Ссылка), ПараметрыВыполнения);
		
	КонецЕсли; 
	
КонецПроцедуры

//++ смарт:Подкин # 28.12.2020 11:11:24 //Подписка на события смартПередЗаписьюКорректировкиДолга
Процедура ПередЗаписьюКорректировкиДолгаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//++ #6654  смарт: Тимофеева 19.05.2026 / Взаиморасчеты. Часть5. Взаимозачет между тремя юр лицами.
	ДатаНачалаОбменаЧерезУФ = Справочники.смартПредопределенныеЗначения.ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат.Значение;
	Если ЗначениеЗаполнено(ДатаНачалаОбменаЧерезУФ)
		И Источник.Дата >= ДатаНачалаОбменаЧерезУФ Тогда
		Возврат;
	КонецЕсли;
	//-- #6654  смарт: Тимофеева 19.05.2026
	
	Если Источник.Дата >= Дата("20201231") Тогда
		
		ТаблицаРеквизитовРегистрации = Новый ТаблицаЗначений;
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("ИмяОбъекта");
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("ИмяПланаОбмена");
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("ИмяТабличнойЧасти");
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("Порядок");
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("РеквизитыРегистрации");
		ТаблицаРеквизитовРегистрации.Колонки.Добавить("СтруктураРеквизитовРегистрации");
		
		НоваяСтрока = ТаблицаРеквизитовРегистрации.Добавить();
		НоваяСтрока.ИмяОбъекта                        =  "Документ.КорректировкаДолга";
		НоваяСтрока.ИмяПланаОбмена                    =  "СинхронизацияДанныхЧерезУниверсальныйФормат";
		НоваяСтрока.ИмяТабличнойЧасти                 =  ""; //ДебиторскаяЗадолженность,КредиторскаяЗадолженность
		НоваяСтрока.Порядок                           =  -50;
		НоваяСтрока.РеквизитыРегистрации              =  "ВидОперации,Организация,ПодразделениеОрганизации,ВалютаДокумента,КурсДокумента,КратностьДокумента,КонтрагентДебитор,КонтрагентКредитор,ИспользоватьВспомогательныйСчет,
		|СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,СуммаКтЗадолженности,СуммаДтЗадолженности,Ответственный,Комментарий,ВидАвансаЗадолженности,ТипАвансаЗадолженности,НомерЧекаККМ";
		НоваяСтрока.СтруктураРеквизитовРегистрации	  = Новый Структура("ВидОперации,Организация,ПодразделениеОрганизации,ВалютаДокумента,КурсДокумента,КратностьДокумента,КонтрагентДебитор,КонтрагентКредитор,ИспользоватьВспомогательныйСчет,
		|СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,СуммаКтЗадолженности,СуммаДтЗадолженности,Ответственный,Комментарий,ВидАвансаЗадолженности,ТипАвансаЗадолженности,НомерЧекаККМ");
		
		//ТЧ  ДебиторскаяЗадолженность
		НоваяСтрока=ТаблицаРеквизитовРегистрации.Добавить();
		НоваяСтрока.ИмяОбъекта                        =  "Документ.КорректировкаДолга";
		НоваяСтрока.ИмяПланаОбмена                    =  "СинхронизацияДанныхЧерезУниверсальныйФормат";
		НоваяСтрока.ИмяТабличнойЧасти                 =  "ДебиторскаяЗадолженность"; 
		НоваяСтрока.Порядок                           =  -50;
		НоваяСтрока.РеквизитыРегистрации              =  "ДоговорКонтрагента,КурсВзаиморасчетов,КратностьВзаиморасчетов,Сделка,Сумма,СуммаНУ,СуммаВзаиморасчетов,СчетУчетаРасчетов,КорДоговорКонтрагента,КорСчетУчетаРасчетов";
		НоваяСтрока.СтруктураРеквизитовРегистрации	  = Новый Структура("ДоговорКонтрагента,КурсВзаиморасчетов,КратностьВзаиморасчетов,Сделка,Сумма,СуммаНУ,СуммаВзаиморасчетов,СчетУчетаРасчетов,КорДоговорКонтрагента,КорСчетУчетаРасчетов");
		
		//ТЧ  КредиторскаяЗадолженность
		НоваяСтрока=ТаблицаРеквизитовРегистрации.Добавить();
		НоваяСтрока.ИмяОбъекта                        =  "Документ.КорректировкаДолга";
		НоваяСтрока.ИмяПланаОбмена                    =  "СинхронизацияДанныхЧерезУниверсальныйФормат";
		НоваяСтрока.ИмяТабличнойЧасти                 =  "КредиторскаяЗадолженность";
		НоваяСтрока.Порядок                           =  -50;
		НоваяСтрока.РеквизитыРегистрации              =  "ДоговорКонтрагента,КурсВзаиморасчетов,КратностьВзаиморасчетов,Сделка,Сумма,СуммаНУ,СуммаВзаиморасчетов,СчетУчетаРасчетов,КорДоговорКонтрагента,КорСчетУчетаРасчетов";
		НоваяСтрока.СтруктураРеквизитовРегистрации	  = Новый Структура("ДоговорКонтрагента,КурсВзаиморасчетов,КратностьВзаиморасчетов,Сделка,Сумма,СуммаНУ,СуммаВзаиморасчетов,СчетУчетаРасчетов,КорДоговорКонтрагента,КорСчетУчетаРасчетов");
		
		ЕстьИзмененияВерсийОбъектов=Ложь;
		
		Для Каждого СтрокаТаблицыРеквизитовРегистрации Из ТаблицаРеквизитовРегистрации Цикл
			
			ЕстьИзмененияВерсийОбъектов = ОпределитьИзмененияВерсийОбъекта(Источник, СтрокаТаблицыРеквизитовРегистрации);
			
			//++ #6644  смарт: Тимофеева 05.05.2026 / Взаиморасчеты. Часть2. Зачет авансов поставщику
			Если ЕстьИзмененияВерсийОбъектов Тогда
				Прервать;
			КонецЕсли;
			//-- #6644  смарт: Тимофеева 05.05.2026
		КонецЦикла;
		
		Если ЕстьИзмененияВерсийОбъектов Тогда
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОтправитьКорректировкуДолга", Новый Структура("Источник", Источник.Ссылка), ПараметрыВыполнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьКорректировкуДолга(Параметры, Адрес) Экспорт
	
	ОбщегоНазначенияБТС.Пауза(5);
	
	ИсточникДанных = Параметры.Источник;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ВерсияФормата", "1.7");
	
	ТзДополнительнаяРегистрация = Новый ТаблицаЗначений;
	ТзДополнительнаяРегистрация.Колонки.Добавить("ВыборПериода", Новый ОписаниеТипов("Булево"));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Отбор");
	ТзДополнительнаяРегистрация.Колонки.Добавить("ОтборСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("ПолноеИмяМетаданных", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ЭлементОтбора = ПользовательскиеОтборы.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ИсточникДанных;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	
	СтандартПериод = Новый СтандартныйПериод;
	СтандартПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	НоваяСтрокаТЗрегистрации = ТзДополнительнаяРегистрация.Добавить();
	НоваяСтрокаТЗрегистрации.ВыборПериода = Ложь;
	НоваяСтрокаТЗрегистрации.Количество = "";
	НоваяСтрокаТЗрегистрации.Отбор = ПользовательскиеОтборы;
	НоваяСтрокаТЗрегистрации.ОтборСтрокой = Строка(ПользовательскиеОтборы);
	НоваяСтрокаТЗрегистрации.Период = СтандартПериод;
	НоваяСтрокаТЗрегистрации.ПолноеИмяМетаданных = "Документ.КорректировкаДолга";
	НоваяСтрокаТЗрегистрации.Представление = "КорректировкаДолга";
	
	СтруктураПараметров.Вставить("МестоВыгрузки", 1);
	СтруктураПараметров.Вставить("ПериодОтбораВсехДокументов", СтандартПериод);
	СтруктураПараметров.Вставить("ПутьКМенеджеруОбменаВыгрузки", "");
	СтруктураПараметров.Вставить("УзелОбмена", Неопределено);
	СтруктураПараметров.Вставить("ЭтоФоновоеЗадание", Истина);
	СтруктураПараметров.Вставить("ДополнительнаяРегистрация", ТзДополнительнаяРегистрация);
	
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	РезультатВыгрузки = Обработка.РезультатВыгрузкиВXML(СтруктураПараметров);
	XMLответ = ПолучитьИзВременногоХранилища(РезультатВыгрузки);
	
	ДобавитьДанныеДляОтправкиВУТ(XMLответ, "/hs/smartaddocum/add/offset", ИсточникДанных);
	
КонецПроцедуры

Процедура ОтправитьОперациюБухСторно(Параметры, Адрес) Экспорт
	
	ОбщегоНазначенияБТС.Пауза(5);
	
	ИсточникДанных=Параметры.Источник.СторнируемыйДокумент;
	
	ДобавитьДанныеДляОтправкиВУТ("", СтрШаблон("/hs/smartaddocum/add/operation?Number=%1&Date=%2&DateOperation=%3", ИсточникДанных.Номер, ИсточникДанных.Дата, Параметры.Источник.Дата), ИсточникДанных);
	
КонецПроцедуры

//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
Процедура ОтправитьОчередьСообщенийВУТ() Экспорт
	
	БазаУТ = сокрЛП(Справочники.смартПредопределенныеЗначения.БазаУТ.Значение);
	СерверУТ = сокрЛП(Справочники.смартПредопределенныеЗначения.СерверУТ.Значение);
	
	Если НЕ ЗначениеЗаполнено(БазаУТ) ИЛИ НЕ ЗначениеЗаполнено(СерверУТ) Тогда
		ЗаписьЖурналаРегистрации("смартОбменСУТ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Данные не будут перенесены в УТ, т.к. не заполнены предпределенные значения справочника смартПредопределенныеЗначения(БазаУТ,СерверУТ)",);
		Возврат;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартОчередьСообщенийВУТ.ИД КАК ИД,
	|	смартОчередьСообщенийВУТ.ДатаСоздания КАК ДатаСоздания,
	|	смартОчередьСообщенийВУТ.Адрес КАК Адрес,
	|	смартОчередьСообщенийВУТ.Сообщение КАК Сообщение,
	|	смартОчередьСообщенийВУТ.Отправлено КАК Отправлено,
	|	смартОчередьСообщенийВУТ.КоличествоПопыток КАК КоличествоПопыток,
	|	смартОчередьСообщенийВУТ.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.смартОчередьСообщенийВУТ КАК смартОчередьСообщенийВУТ
	|ГДЕ
	|	НЕ смартОчередьСообщенийВУТ.Отправлено
	|	И смартОчередьСообщенийВУТ.КоличествоПопыток < 3
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		// создаем новое HTTP соединение с указанием сервера
		HTTP = Новый HTTPСоединение(СерверУТ, 443, "Администратор", "19320998",,, Новый ЗащищенноеСоединениеOpenSSL);
		
		//получим временный файл для передачи в теле POST-запроса
		ФайлТелаЗапроса = ПолучитьИмяВременногоФайла();
		//запишем в файл содержимое тела запроса (текст)
		ТекстФайл = Новый ТекстовыйДокумент;
		ТекстФайл.УстановитьТекст(Выборка.Сообщение);
		ТекстФайл.Записать(ФайлТелаЗапроса, КодировкаТекста.UTF8);
		//получим размер данных для передачи в заголовок
		ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);
		РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер());
		
		//заголовок создадим в виде соответствия
		ЗаголовокЗапросаHTTP = Новый Соответствие();
		//передаем в заголовках размер и тип данных на отправку
		ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/xml; charset=utf-8");
		
		ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1%2", БазаУТ , Выборка.Адрес), ЗаголовокЗапросаHTTP);

		//загрузить строку в тело
		ЗапросHTTP.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
		
		//отсылаем POST-запрос на обработку.
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
		ОтветПользователю = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			
			рег = РегистрыСведений.смартОчередьСообщенийВУТ.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(рег, Выборка);
			рег.ДатаОтправки = ТекущаяДата();
			рег.Отправлено = Истина;
			рег.Ошибка = Ложь;
			рег.КоличествоПопыток = Выборка.КоличествоПопыток + 1;
			рег.ТекстОшибки = "";
			рег.Записать(Истина);
			
			Если ЗначениеЗаполнено(Выборка.Объект) Тогда
				
				МенеджерЗаписи = РегистрыСведений.смартОтправленыВУТ.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ОбъектОтправки = Выборка.Объект;
				МенеджерЗаписи.Сообщение = ОтветПользователю;
				МенеджерЗаписи.Статус = Истина;
				МенеджерЗаписи.ОтправленXML = Выборка.Сообщение;
				МенеджерЗаписи.Записать();
				
			КонецЕсли;
			
		Иначе
			
			рег = РегистрыСведений.смартОчередьСообщенийВУТ.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(рег, Выборка);
			рег.ДатаОтправки = ТекущаяДата();
			рег.Отправлено = Ложь;
			рег.Ошибка = Истина;
			рег.КоличествоПопыток = Выборка.КоличествоПопыток + 1;
			рег.ТекстОшибки = ОтветПользователю;
			рег.Записать(Истина);
			
			Если ЗначениеЗаполнено(Выборка.Объект) Тогда
				
				МенеджерЗаписи = РегистрыСведений.смартОтправленыВУТ.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ОбъектОтправки = Выборка.Объект;
				МенеджерЗаписи.Сообщение = ОтветПользователю;
				МенеджерЗаписи.Статус = Ложь;
				МенеджерЗаписи.ОтправленXML = Выборка.Сообщение;
				МенеджерЗаписи.Записать();
				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("смартОбменСУТ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ОтветПользователю,);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
Процедура смартФормированиеДанныхПоМаркировкеДляПередачиВУТ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартМаркировка.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.смартМаркировка КАК смартМаркировка
	|ГДЕ
	|	НЕ смартМаркировка.ЭтотУзел";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПередатьДанныеМаркировкиВУТ(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
Процедура ПередатьДанныеМаркировкиВУТ(Узел) Экспорт
	
	Обработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();
    Обработка.РежимОбмена = "Выгрузка";
	
    ФайлПравилОбмена = ПолучитьИмяВременногоФайла("xml");
	ИмяФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ПравилаОбмена = Справочники.смартПравилаОбменаДанными.ПравилаОбменаМаркировкойСУТ.Правила.Получить();
    ПравилаОбмена.Записать(ФайлПравилОбмена);
	
    Обработка.ИмяФайлаПравилОбмена = ФайлПравилОбмена;
    Обработка.ЗагружатьДанныеВРежимеОбмена = Истина;
    Обработка.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
    Обработка.ЗапоминатьЗагруженныеОбъекты = Истина;
    Обработка.ВыгружатьТолькоРазрешенные = Истина;
    Обработка.ИмяФайлаОбмена = ИмяФайлаОбмена;
    Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 1; // 0 - не снимать регистрацию, 1 - снимать регистрацию
    Обработка.ЗагрузитьПравилаОбмена();
	
	Для Каждого Стр Из Обработка.ТаблицаПравилВыгрузки.Строки Цикл
		
        Стр.Включить = 1;
		
		Для Каждого Стр1 Из Стр.Строки Цикл
			
            Стр1.Включить = 1;
            Стр1.СсылкаНаУзелОбмена = Узел;
			
		КонецЦикла;
		
    КонецЦикла;
	
    Обработка.ВыполнитьВыгрузку();
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяФайлаОбмена);
	
	ДобавитьДанныеДляОтправкиВУТ(Текст.ПолучитьТекст(), "/hs/smartaddocum/add/universaldata");
	
	УдалитьФайлы(ФайлПравилОбмена);
	УдалитьФайлы(ИмяФайлаОбмена);
	
КонецПроцедуры

//++ #Б5136 смарт: Шляпников 27.01.2026 / Маркировка радиоэлектронной продукции. Синхронизация данных. Приемка товара.
Процедура ДобавитьДанныеДляОтправкиВУТ(Данные, Адрес, Объект = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	рег = РегистрыСведений.смартОчередьСообщенийВУТ.СоздатьМенеджерЗаписи();
	рег.ИД = Новый УникальныйИдентификатор;
	рег.ДатаСоздания = ТекущаяДата();
	рег.Адрес = Адрес;
	рег.Сообщение = Данные;
	рег.Объект = Объект;
	рег.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СоздатьСтруктуруПоРегиструСведений(ИмяРегистраСведений) Экспорт
	
    // Получаем описание регистра сведений из метаданных
    РегистрСведений = Метаданные.РегистрыСведений[ИмяРегистраСведений];
    
    // Проверяем, существует ли указанный регистр сведений
    Если РегистрСведений = Неопределено Тогда
        ВызватьИсключение "Регистр сведений '" + ИмяРегистраСведений + "' не найден!";
    КонецЕсли;
    
    // Создаем новую структуру
    НоваяСтруктура = Новый Структура;
    
    // Добавляем измерения
    Для Каждого Измерение Из РегистрСведений.Измерения Цикл
        НоваяСтруктура.Вставить(Измерение.Имя, Неопределено);
    КонецЦикла;
    
    // Добавляем ресурсы
    Для Каждого Ресурс Из РегистрСведений.Ресурсы Цикл
        НоваяСтруктура.Вставить(Ресурс.Имя, Неопределено);
    КонецЦикла;
    
    // Возвращаем созданную структуру
    Возврат НоваяСтруктура;
	
КонецФункции

Функция ПолучитьАдресаПользователей(мПользователи, АдресаДляОтправкиСтрокой = "") Экспорт
	
	МассивАдресов = Новый Массив;
	
	ОтборПользователей = Новый Массив;
	Если ТипЗнч(мПользователи) = Тип("Массив") Тогда
		ОтборПользователей  = мПользователи;
	ИначеЕсли ТипЗнч(мПользователи) = Тип("СправочникСсылка.Пользователи") Тогда
		ОтборПользователей.Добавить(мПользователи);
	Иначе
		Возврат МассивАдресов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиСпр
	|ГДЕ 
	|	ПользователиСпр.Ссылка В (&Пользователи)
	|	И ПользователиСпр.смартРабочаяПочта <> """"";
	
	Запрос.УстановитьПараметр("Пользователи", ОтборПользователей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;

КонецФункции 

#КонецОбласти

#Область Служебные

Функция ОпределитьИзмененияВерсийОбъекта(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	Если ПустаяСтрока(СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти) Тогда // реквизиты Шапки объекта
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииШапкиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации);
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииШапкиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации);
		
	Иначе // реквизиты ТЧ объекта
		
		// Проверка, что это ТЧ объекта, а не таблица регистра.
		Если Объект.Метаданные().ТабличныеЧасти.Найти(СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииТабличнойЧастиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации);
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииТабличнойЧастиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации);
		
	КонецЕсли;
	
	Возврат Не ТаблицыРеквизитовРегистрацииОдинаковые(ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения, ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения, СтрокаТаблицыРеквизитовРегистрации);
	
КонецФункции
	
Функция РеквизитыРегистрацииШапкиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ " + СтрокаТаблицыРеквизитовРегистрации.РеквизитыРегистрации 
	  + " ИЗ " + СтрокаТаблицыРеквизитовРегистрации.ИмяОбъекта + " КАК ТекущийОбъект
	|ГДЕ
	|   ТекущийОбъект.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РеквизитыРегистрацииТабличнойЧастиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ "+ СтрокаТаблицыРеквизитовРегистрации.РеквизитыРегистрации
	+ " ИЗ " + СтрокаТаблицыРеквизитовРегистрации.ИмяОбъекта 
	+ "." + СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти + " КАК ТекущийОбъектИмяТабличнойЧасти
	|ГДЕ
	|   ТекущийОбъектИмяТабличнойЧасти.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РеквизитыРегистрацииШапкиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	СтруктураРеквизитовРегистрации = СтрокаТаблицыРеквизитовРегистрации.СтруктураРеквизитовРегистрации;
	
	ТаблицаРеквизитовРегистрации = Новый ТаблицаЗначений;
	
	Для Каждого РеквизитРегистрации Из СтруктураРеквизитовРегистрации Цикл
		
		ТаблицаРеквизитовРегистрации.Колонки.Добавить(РеквизитРегистрации.Ключ);
		
	КонецЦикла;
	
	СтрокаТаблицы = ТаблицаРеквизитовРегистрации.Добавить();
	
	Для Каждого РеквизитРегистрации Из СтруктураРеквизитовРегистрации Цикл
		
		СтрокаТаблицы[РеквизитРегистрации.Ключ] = Объект[РеквизитРегистрации.Ключ];
		
	КонецЦикла;
	
	Возврат ТаблицаРеквизитовРегистрации;
КонецФункции

Функция РеквизитыРегистрацииТабличнойЧастиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТаблицаРеквизитовРегистрации = Объект[СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти].Выгрузить(, СтрокаТаблицыРеквизитовРегистрации.РеквизитыРегистрации);
	
	Возврат ТаблицаРеквизитовРегистрации;
	
КонецФункции

Функция ТаблицыРеквизитовРегистрацииОдинаковые(Таблица1, Таблица2, СтрокаТаблицыРеквизитовРегистрации)
	
	ДобавитьКолонкуСоЗначениемВТаблицу(Таблица1, +1);
	ДобавитьКолонкуСоЗначениемВТаблицу(Таблица2, -1);
	
	ТаблицаРезультат = Таблица1.Скопировать();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Таблица2, ТаблицаРезультат);
	
	ТаблицаРезультат.Свернуть(СтрокаТаблицыРеквизитовРегистрации.РеквизитыРегистрации, "ИтераторТаблицыРеквизитовРегистрации");
	
	КоличествоОдинаковыхСтрок = ТаблицаРезультат.НайтиСтроки(Новый Структура ("ИтераторТаблицыРеквизитовРегистрации", 0)).Количество();
	
	КоличествоСтрокТаблицы = ТаблицаРезультат.Количество();
	
	Возврат КоличествоОдинаковыхСтрок = КоличествоСтрокТаблицы;
	
КонецФункции

Процедура ДобавитьКолонкуСоЗначениемВТаблицу(Таблица, ЗначениеИтератора)
	
	Таблица.Колонки.Добавить("ИтераторТаблицыРеквизитовРегистрации");
	
	Таблица.ЗаполнитьЗначения(ЗначениеИтератора, "ИтераторТаблицыРеквизитовРегистрации");
	
КонецПроцедуры

#КонецОбласти
